Heltec-Aaron-Lee/WiFi_Kit_series/esp32/boards.txt
WIFI_LoRa_32_V3.menu.LORAWAN_DEVEUI.0=CUSTOM
WIFI_LoRa_32_V3.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
WIFI_LoRa_32_V3.menu.LORAWAN_DEVEUI.1=Generate By ChipID
WIFI_LoRa_32_V3.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

WIFI_LoRa_32_V3.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
WIFI_LoRa_32_V3.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
WIFI_LoRa_32_V3.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
WIFI_LoRa_32_V3.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

WIFI_LoRa_32_V3.build.defines=-D{build.band} -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -D{build.board}
WIFI_LoRa_32_V3.build.extra_libs=-lheltec_0
##############################################################

wireless_mini_shell.name=Wireless Mini Shell
wireless_mini_shell.vid.0=0x303a
wireless_mini_shell.pid.0=0x1001

wireless_mini_shell.bootloader.tool=esptool_py
wireless_mini_shell.bootloader.tool.default=esptool_py

wireless_mini_shell.upload.tool=esptool_py
wireless_mini_shell.upload.tool.default=esptool_py
wireless_mini_shell.upload.tool.network=esp_ota

wireless_mini_shell.upload.maximum_size=1310720
wireless_mini_shell.upload.maximum_data_size=327680
wireless_mini_shell.upload.flags=
wireless_mini_shell.upload.extra_flags=
wireless_mini_shell.upload.use_1200bps_touch=false
wireless_mini_shell.upload.wait_for_upload_port=false

wireless_mini_shell.serial.disableDTR=false
wireless_mini_shell.serial.disableRTS=false

wireless_mini_shell.build.tarch=riscv32
wireless_mini_shell.build.target=esp
wireless_mini_shell.build.mcu=esp32c3
wireless_mini_shell.build.core=esp32
wireless_mini_shell.build.variant=esp32c3
wireless_mini_shell.build.board=Wireless_Mini_Shell
wireless_mini_shell.build.bootloader_addr=0x0

wireless_mini_shell.build.cdc_on_boot=0
wireless_mini_shell.build.f_cpu=160000000L
wireless_mini_shell.build.flash_size=4MB
wireless_mini_shell.build.flash_freq=80m
wireless_mini_shell.build.flash_mode=dio
wireless_mini_shell.build.boot=qio
wireless_mini_shell.build.partitions=default

wireless_mini_shell.menu.LORAWAN_REGION.0=REGION_EU868
wireless_mini_shell.menu.LORAWAN_REGION.0.build.band=REGION_EU868
wireless_mini_shell.menu.LORAWAN_REGION.1=REGION_EU433
wireless_mini_shell.menu.LORAWAN_REGION.1.build.band=REGION_EU433
wireless_mini_shell.menu.LORAWAN_REGION.2=REGION_CN470
wireless_mini_shell.menu.LORAWAN_REGION.2.build.band=REGION_CN470
wireless_mini_shell.menu.LORAWAN_REGION.3=REGION_US915
wireless_mini_shell.menu.LORAWAN_REGION.3.build.band=REGION_US915
wireless_mini_shell.menu.LORAWAN_REGION.4=REGION_AU915
wireless_mini_shell.menu.LORAWAN_REGION.4.build.band=REGION_AU915
wireless_mini_shell.menu.LORAWAN_REGION.5=REGION_CN779
wireless_mini_shell.menu.LORAWAN_REGION.5.build.band=REGION_CN779
wireless_mini_shell.menu.LORAWAN_REGION.6=REGION_AS923
wireless_mini_shell.menu.LORAWAN_REGION.6.build.band=REGION_AS923
wireless_mini_shell.menu.LORAWAN_REGION.7=REGION_KR920
wireless_mini_shell.menu.LORAWAN_REGION.7.build.band=REGION_KR920
wireless_mini_shell.menu.LORAWAN_REGION.8=REGION_IN865
wireless_mini_shell.menu.LORAWAN_REGION.8.build.band=REGION_IN865
wireless_mini_shell.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
wireless_mini_shell.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

wireless_mini_shell.menu.CPUFreq.160=160MHz (WiFi)
wireless_mini_shell.menu.CPUFreq.160.build.f_cpu=160000000L
wireless_mini_shell.menu.CPUFreq.80=80MHz (WiFi)
wireless_mini_shell.menu.CPUFreq.80.build.f_cpu=80000000L
wireless_mini_shell.menu.CPUFreq.40=40MHz
wireless_mini_shell.menu.CPUFreq.40.build.f_cpu=40000000L
wireless_mini_shell.menu.CPUFreq.20=20MHz
wireless_mini_shell.menu.CPUFreq.20.build.f_cpu=20000000L
wireless_mini_shell.menu.CPUFreq.10=10MHz
wireless_mini_shell.menu.CPUFreq.10.build.f_cpu=10000000L

wireless_mini_shell.menu.UploadSpeed.921600=921600
wireless_mini_shell.menu.UploadSpeed.921600.upload.speed=921600
wireless_mini_shell.menu.UploadSpeed.115200=115200
wireless_mini_shell.menu.UploadSpeed.115200.upload.speed=115200
wireless_mini_shell.menu.UploadSpeed.256000.windows=256000
wireless_mini_shell.menu.UploadSpeed.256000.upload.speed=256000
wireless_mini_shell.menu.UploadSpeed.230400.windows.upload.speed=256000
wireless_mini_shell.menu.UploadSpeed.230400=230400
wireless_mini_shell.menu.UploadSpeed.230400.upload.speed=230400
wireless_mini_shell.menu.UploadSpeed.460800.linux=460800
wireless_mini_shell.menu.UploadSpeed.460800.macosx=460800
wireless_mini_shell.menu.UploadSpeed.460800.upload.speed=460800
wireless_mini_shell.menu.UploadSpeed.512000.windows=512000
wireless_mini_shell.menu.UploadSpeed.512000.upload.speed=512000

wireless_mini_shell.menu.DebugLevel.none=None
wireless_mini_shell.menu.DebugLevel.none.build.code_debug=0
wireless_mini_shell.menu.DebugLevel.error=Error
wireless_mini_shell.menu.DebugLevel.error.build.code_debug=1
wireless_mini_shell.menu.DebugLevel.warn=Warn
wireless_mini_shell.menu.DebugLevel.warn.build.code_debug=2
wireless_mini_shell.menu.DebugLevel.info=Info
wireless_mini_shell.menu.DebugLevel.info.build.code_debug=3
wireless_mini_shell.menu.DebugLevel.debug=Debug
wireless_mini_shell.menu.DebugLevel.debug.build.code_debug=4
wireless_mini_shell.menu.DebugLevel.verbose=Verbose
wireless_mini_shell.menu.DebugLevel.verbose.build.code_debug=5

wireless_mini_shell.menu.LoRaWanDebugLevel.0=None
wireless_mini_shell.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
wireless_mini_shell.menu.LoRaWanDebugLevel.1=Freq
wireless_mini_shell.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
wireless_mini_shell.menu.LoRaWanDebugLevel.2=Freq && DIO
wireless_mini_shell.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
wireless_mini_shell.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
wireless_mini_shell.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3


wireless_mini_shell.menu.LORAWAN_DEVEUI.0=CUSTOM
wireless_mini_shell.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
wireless_mini_shell.menu.LORAWAN_DEVEUI.1=Generate By ChipID
wireless_mini_shell.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

wireless_mini_shell.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
wireless_mini_shell.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
wireless_mini_shell.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
wireless_mini_shell.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

