Heltec-Aaron-Lee/WiFi_Kit_series/esp32/boards.txt
wireless_mini_shell.build.defines=-D{build.band} -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -D{build.board}
wireless_mini_shell.build.extra_libs=-lheltec

##############################################################

Wireless_Stick_V3.name=Wireless Stick(V3)
Wireless_Stick_V3.vid.0=0x303a
Wireless_Stick_V3.pid.0=0x1001

Wireless_Stick_V3.bootloader.tool=esptool_py
Wireless_Stick_V3.bootloader.tool.default=esptool_py

Wireless_Stick_V3.upload.tool=esptool_py
Wireless_Stick_V3.upload.tool.default=esptool_py
Wireless_Stick_V3.upload.tool.network=esp_ota

Wireless_Stick_V3.upload.maximum_size=1310720
Wireless_Stick_V3.upload.maximum_data_size=327680
Wireless_Stick_V3.upload.flags=
Wireless_Stick_V3.upload.extra_flags=
Wireless_Stick_V3.upload.use_1200bps_touch=false
Wireless_Stick_V3.upload.wait_for_upload_port=false

Wireless_Stick_V3.serial.disableDTR=false
Wireless_Stick_V3.serial.disableRTS=false

Wireless_Stick_V3.build.tarch=xtensa
Wireless_Stick_V3.build.bootloader_addr=0x0
Wireless_Stick_V3.build.target=esp32s3
Wireless_Stick_V3.build.mcu=esp32s3
Wireless_Stick_V3.build.core=esp32
Wireless_Stick_V3.build.variant=Wireless_Stick_V3
Wireless_Stick_V3.build.board=Wireless_Stick_V3

Wireless_Stick_V3.build.usb_mode=1
Wireless_Stick_V3.build.cdc_on_boot=0
Wireless_Stick_V3.build.msc_on_boot=0
Wireless_Stick_V3.build.dfu_on_boot=0
Wireless_Stick_V3.build.f_cpu=240000000L
Wireless_Stick_V3.build.flash_size=8MB
Wireless_Stick_V3.build.flash_freq=80m
Wireless_Stick_V3.build.flash_mode=dio
Wireless_Stick_V3.build.boot=qio
Wireless_Stick_V3.build.boot_freq=80m
Wireless_Stick_V3.build.partitions=default_8MB
Wireless_Stick_V3.build.loop_core=
Wireless_Stick_V3.build.event_core=
Wireless_Stick_V3.build.psram_type=qspi
Wireless_Stick_V3.build.memory_type={build.boot}_{build.psram_type}

Wireless_Stick_V3.menu.LoopCore.1=Core 1
Wireless_Stick_V3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
Wireless_Stick_V3.menu.LoopCore.0=Core 0
Wireless_Stick_V3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

Wireless_Stick_V3.menu.EventsCore.1=Core 1
Wireless_Stick_V3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
Wireless_Stick_V3.menu.EventsCore.0=Core 0
Wireless_Stick_V3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

Wireless_Stick_V3.menu.CPUFreq.240=240MHz (WiFi)
Wireless_Stick_V3.menu.CPUFreq.240.build.f_cpu=240000000L
Wireless_Stick_V3.menu.CPUFreq.160=160MHz (WiFi)
Wireless_Stick_V3.menu.CPUFreq.160.build.f_cpu=160000000L
Wireless_Stick_V3.menu.CPUFreq.80=80MHz (WiFi)
Wireless_Stick_V3.menu.CPUFreq.80.build.f_cpu=80000000L
Wireless_Stick_V3.menu.CPUFreq.40=40MHz
Wireless_Stick_V3.menu.CPUFreq.40.build.f_cpu=40000000L
Wireless_Stick_V3.menu.CPUFreq.20=20MHz
Wireless_Stick_V3.menu.CPUFreq.20.build.f_cpu=20000000L
Wireless_Stick_V3.menu.CPUFreq.10=10MHz
Wireless_Stick_V3.menu.CPUFreq.10.build.f_cpu=10000000L

Wireless_Stick_V3.menu.UploadSpeed.921600=921600
Wireless_Stick_V3.menu.UploadSpeed.921600.upload.speed=921600
Wireless_Stick_V3.menu.UploadSpeed.115200=115200
Wireless_Stick_V3.menu.UploadSpeed.115200.upload.speed=115200
Wireless_Stick_V3.menu.UploadSpeed.256000.windows=256000
Wireless_Stick_V3.menu.UploadSpeed.256000.upload.speed=256000
Wireless_Stick_V3.menu.UploadSpeed.230400.windows.upload.speed=256000
Wireless_Stick_V3.menu.UploadSpeed.230400=230400
Wireless_Stick_V3.menu.UploadSpeed.230400.upload.speed=230400
Wireless_Stick_V3.menu.UploadSpeed.460800.linux=460800
Wireless_Stick_V3.menu.UploadSpeed.460800.macosx=460800
Wireless_Stick_V3.menu.UploadSpeed.460800.upload.speed=460800
Wireless_Stick_V3.menu.UploadSpeed.512000.windows=512000
Wireless_Stick_V3.menu.UploadSpeed.512000.upload.speed=512000

Wireless_Stick_V3.menu.DebugLevel.none=None
Wireless_Stick_V3.menu.DebugLevel.none.build.code_debug=0
Wireless_Stick_V3.menu.DebugLevel.error=Error
Wireless_Stick_V3.menu.DebugLevel.error.build.code_debug=1
Wireless_Stick_V3.menu.DebugLevel.warn=Warn
Wireless_Stick_V3.menu.DebugLevel.warn.build.code_debug=2
Wireless_Stick_V3.menu.DebugLevel.info=Info
Wireless_Stick_V3.menu.DebugLevel.info.build.code_debug=3
Wireless_Stick_V3.menu.DebugLevel.debug=Debug
Wireless_Stick_V3.menu.DebugLevel.debug.build.code_debug=4
Wireless_Stick_V3.menu.DebugLevel.verbose=Verbose
Wireless_Stick_V3.menu.DebugLevel.verbose.build.code_debug=5

Wireless_Stick_V3.menu.LORAWAN_REGION.0=REGION_EU868
Wireless_Stick_V3.menu.LORAWAN_REGION.0.build.band=REGION_EU868
Wireless_Stick_V3.menu.LORAWAN_REGION.1=REGION_EU433
Wireless_Stick_V3.menu.LORAWAN_REGION.1.build.band=REGION_EU433
Wireless_Stick_V3.menu.LORAWAN_REGION.2=REGION_CN470
Wireless_Stick_V3.menu.LORAWAN_REGION.2.build.band=REGION_CN470
Wireless_Stick_V3.menu.LORAWAN_REGION.3=REGION_US915
Wireless_Stick_V3.menu.LORAWAN_REGION.3.build.band=REGION_US915
Wireless_Stick_V3.menu.LORAWAN_REGION.4=REGION_AU915
Wireless_Stick_V3.menu.LORAWAN_REGION.4.build.band=REGION_AU915
Wireless_Stick_V3.menu.LORAWAN_REGION.5=REGION_CN779
Wireless_Stick_V3.menu.LORAWAN_REGION.5.build.band=REGION_CN779
Wireless_Stick_V3.menu.LORAWAN_REGION.6=REGION_AS923
Wireless_Stick_V3.menu.LORAWAN_REGION.6.build.band=REGION_AS923
Wireless_Stick_V3.menu.LORAWAN_REGION.7=REGION_KR920
Wireless_Stick_V3.menu.LORAWAN_REGION.7.build.band=REGION_KR920
Wireless_Stick_V3.menu.LORAWAN_REGION.8=REGION_IN865
Wireless_Stick_V3.menu.LORAWAN_REGION.8.build.band=REGION_IN865
Wireless_Stick_V3.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
Wireless_Stick_V3.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

Wireless_Stick_V3.menu.LoRaWanDebugLevel.0=None
Wireless_Stick_V3.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
Wireless_Stick_V3.menu.LoRaWanDebugLevel.1=Freq
Wireless_Stick_V3.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
Wireless_Stick_V3.menu.LoRaWanDebugLevel.2=Freq && DIO
Wireless_Stick_V3.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
Wireless_Stick_V3.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
Wireless_Stick_V3.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3

Wireless_Stick_V3.menu.LORAWAN_DEVEUI.0=CUSTOM
Wireless_Stick_V3.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
Wireless_Stick_V3.menu.LORAWAN_DEVEUI.1=Generate By ChipID
Wireless_Stick_V3.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

Wireless_Stick_V3.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
Wireless_Stick_V3.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
Wireless_Stick_V3.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
Wireless_Stick_V3.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

Wireless_Stick_V3.build.defines=-D{build.band} -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -D{build.board}
Wireless_Stick_V3.build.extra_libs=-lheltec_0
##############################################################

wifi_kit_32.name=WiFi Kit 32

wifi_kit_32.bootloader.tool=esptool_py
wifi_kit_32.bootloader.tool.default=esptool_py

wifi_kit_32.upload.tool=esptool_py
wifi_kit_32.upload.tool.default=esptool_py
wifi_kit_32.upload.tool.network=esp_ota

wifi_kit_32.upload.maximum_size=1310720
wifi_kit_32.upload.maximum_data_size=327680
wifi_kit_32.upload.flags=
wifi_kit_32.upload.extra_flags=

