Heltec-Aaron-Lee/WiFi_Kit_series/esp32/boards.txt
wifi_kit_32_V3.menu.DebugLevel.none=None
wifi_kit_32_V3.menu.DebugLevel.none.build.code_debug=0
wifi_kit_32_V3.menu.DebugLevel.error=Error
wifi_kit_32_V3.menu.DebugLevel.error.build.code_debug=1
wifi_kit_32_V3.menu.DebugLevel.warn=Warn
wifi_kit_32_V3.menu.DebugLevel.warn.build.code_debug=2
wifi_kit_32_V3.menu.DebugLevel.info=Info
wifi_kit_32_V3.menu.DebugLevel.info.build.code_debug=3
wifi_kit_32_V3.menu.DebugLevel.debug=Debug
wifi_kit_32_V3.menu.DebugLevel.debug.build.code_debug=4
wifi_kit_32_V3.menu.DebugLevel.verbose=Verbose
wifi_kit_32_V3.menu.DebugLevel.verbose.build.code_debug=5


##############################################################

wifi_lora_32.name=WiFi LoRa 32

wifi_lora_32.bootloader.tool=esptool_py
wifi_lora_32.bootloader.tool.default=esptool_py

wifi_lora_32.upload.tool=esptool_py
wifi_lora_32.upload.tool.default=esptool_py
wifi_lora_32.upload.tool.network=esp_ota

wifi_lora_32.upload.maximum_size=1310720
wifi_lora_32.upload.maximum_data_size=327680
wifi_lora_32.upload.flags=
wifi_lora_32.upload.extra_flags=

wifi_lora_32.serial.disableDTR=true
wifi_lora_32.serial.disableRTS=true

wifi_lora_32.build.tarch=xtensa
wifi_lora_32.build.bootloader_addr=0x1000
wifi_lora_32.build.target=esp32
wifi_lora_32.build.mcu=esp32
wifi_lora_32.build.core=esp32
wifi_lora_32.build.variant=wifi_lora_32
wifi_lora_32.build.board=WIFI_LoRa_32

wifi_lora_32.build.f_cpu=240000000L
wifi_lora_32.build.flash_size=4MB
wifi_lora_32.build.flash_freq=80m
wifi_lora_32.build.flash_mode=dio
wifi_lora_32.build.boot=dio
wifi_lora_32.build.partitions=default
wifi_lora_32.build.defines=-D{build.band} -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -D{build.board}
wifi_lora_32.build.extra_libs=-lheltec

wifi_lora_32.menu.CPUFreq.240=240MHz (WiFi/BT)
wifi_lora_32.menu.CPUFreq.240.build.f_cpu=240000000L
wifi_lora_32.menu.CPUFreq.160=160MHz (WiFi/BT)
wifi_lora_32.menu.CPUFreq.160.build.f_cpu=160000000L
wifi_lora_32.menu.CPUFreq.80=80MHz (WiFi/BT)
wifi_lora_32.menu.CPUFreq.160.build.f_cpu=80000000L

wifi_lora_32.menu.UploadSpeed.921600=921600
wifi_lora_32.menu.UploadSpeed.921600.upload.speed=921600
wifi_lora_32.menu.UploadSpeed.115200=115200
wifi_lora_32.menu.UploadSpeed.115200.upload.speed=115200
wifi_lora_32.menu.UploadSpeed.256000.windows=256000
wifi_lora_32.menu.UploadSpeed.256000.upload.speed=256000
wifi_lora_32.menu.UploadSpeed.230400.windows.upload.speed=256000
wifi_lora_32.menu.UploadSpeed.230400=230400
wifi_lora_32.menu.UploadSpeed.230400.upload.speed=230400
wifi_lora_32.menu.UploadSpeed.460800.linux=460800
wifi_lora_32.menu.UploadSpeed.460800.macosx=460800
wifi_lora_32.menu.UploadSpeed.460800.upload.speed=460800
wifi_lora_32.menu.UploadSpeed.512000.windows=512000
wifi_lora_32.menu.UploadSpeed.512000.upload.speed=512000

wifi_lora_32.menu.DebugLevel.none=None
wifi_lora_32.menu.DebugLevel.none.build.code_debug=0
wifi_lora_32.menu.DebugLevel.error=Error
wifi_lora_32.menu.DebugLevel.error.build.code_debug=1
wifi_lora_32.menu.DebugLevel.warn=Warn
wifi_lora_32.menu.DebugLevel.warn.build.code_debug=2
wifi_lora_32.menu.DebugLevel.info=Info
wifi_lora_32.menu.DebugLevel.info.build.code_debug=3
wifi_lora_32.menu.DebugLevel.debug=Debug
wifi_lora_32.menu.DebugLevel.debug.build.code_debug=4
wifi_lora_32.menu.DebugLevel.verbose=Verbose
wifi_lora_32.menu.DebugLevel.verbose.build.code_debug=5

wifi_lora_32.menu.LORAWAN_REGION.0=REGION_EU868
wifi_lora_32.menu.LORAWAN_REGION.0.build.band=REGION_EU868
wifi_lora_32.menu.LORAWAN_REGION.1=REGION_EU433
wifi_lora_32.menu.LORAWAN_REGION.1.build.band=REGION_EU433
wifi_lora_32.menu.LORAWAN_REGION.2=REGION_CN470
wifi_lora_32.menu.LORAWAN_REGION.2.build.band=REGION_CN470
wifi_lora_32.menu.LORAWAN_REGION.3=REGION_US915
wifi_lora_32.menu.LORAWAN_REGION.3.build.band=REGION_US915
wifi_lora_32.menu.LORAWAN_REGION.4=REGION_AU915
wifi_lora_32.menu.LORAWAN_REGION.4.build.band=REGION_AU915
wifi_lora_32.menu.LORAWAN_REGION.5=REGION_CN779
wifi_lora_32.menu.LORAWAN_REGION.5.build.band=REGION_CN779
wifi_lora_32.menu.LORAWAN_REGION.6=REGION_AS923
wifi_lora_32.menu.LORAWAN_REGION.6.build.band=REGION_AS923
wifi_lora_32.menu.LORAWAN_REGION.7=REGION_KR920
wifi_lora_32.menu.LORAWAN_REGION.7.build.band=REGION_KR920
wifi_lora_32.menu.LORAWAN_REGION.8=REGION_IN865
wifi_lora_32.menu.LORAWAN_REGION.8.build.band=REGION_IN865
wifi_lora_32.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
wifi_lora_32.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

wifi_lora_32.menu.LoRaWanDebugLevel.0=None
wifi_lora_32.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
wifi_lora_32.menu.LoRaWanDebugLevel.1=Freq
wifi_lora_32.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
wifi_lora_32.menu.LoRaWanDebugLevel.2=Freq && DIO
wifi_lora_32.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
wifi_lora_32.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
wifi_lora_32.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3

wifi_lora_32.menu.LORAWAN_DEVEUI.0=CUSTOM
wifi_lora_32.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
wifi_lora_32.menu.LORAWAN_DEVEUI.1=Generate By ChipID
wifi_lora_32.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

wifi_lora_32.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
wifi_lora_32.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
wifi_lora_32.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
wifi_lora_32.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

##############################################################

wifi_lora_32_V2.name=WiFi LoRa 32(V2)

wifi_lora_32_V2.bootloader.tool=esptool_py
wifi_lora_32_V2.bootloader.tool.default=esptool_py

wifi_lora_32_V2.upload.tool=esptool_py
wifi_lora_32_V2.upload.tool.default=esptool_py
wifi_lora_32_V2.upload.tool.network=esp_ota

wifi_lora_32_V2.upload.maximum_size=3342336
wifi_lora_32_V2.upload.maximum_data_size=327680
wifi_lora_32_V2.upload.flags=
wifi_lora_32_V2.upload.extra_flags=

wifi_lora_32_V2.serial.disableDTR=true
wifi_lora_32_V2.serial.disableRTS=true

wifi_lora_32_V2.build.tarch=xtensa
wifi_lora_32_V2.build.bootloader_addr=0x1000
wifi_lora_32_V2.build.target=esp32
wifi_lora_32_V2.build.mcu=esp32
wifi_lora_32_V2.build.core=esp32
wifi_lora_32_V2.build.variant=wifi_lora_32_V2
wifi_lora_32_V2.build.board=WIFI_LoRa_32_V2

