Heltec-Aaron-Lee/WiFi_Kit_series/esp32/boards.txt
wireless_track.build.tarch=xtensa
wireless_track.build.bootloader_addr=0x0
wireless_track.build.target=esp32s3
wireless_track.build.mcu=esp32s3
wireless_track.build.core=esp32
wireless_track.build.variant=wireless_track
wireless_track.build.board=Wireless_Track

wireless_track.build.usb_mode=1
wireless_track.build.cdc_on_boot=0
wireless_track.build.msc_on_boot=0
wireless_track.build.dfu_on_boot=0
wireless_track.build.f_cpu=240000000L
wireless_track.build.flash_size=4MB
wireless_track.build.flash_freq=80m
wireless_track.build.flash_mode=dio
wireless_track.build.boot=qio
wireless_track.build.boot_freq=80m
wireless_track.build.partitions=default
wireless_track.build.loop_core=
wireless_track.build.event_core=
wireless_track.build.psram_type=qspi
wireless_track.build.memory_type={build.boot}_{build.psram_type}

wireless_track.menu.PSRAM.disabled=Disabled
wireless_track.menu.PSRAM.disabled.build.psram_val=
wireless_track.menu.PSRAM.disabled.build.psram_type=qspi
wireless_track.menu.PSRAM.enabled=QSPI PSRAM
wireless_track.menu.PSRAM.enabled.build.psram_val=-DBOARD_HAS_PSRAM
wireless_track.menu.PSRAM.enabled.build.psram_type=qspi
wireless_track.menu.PSRAM.opi=OPI PSRAM
wireless_track.menu.PSRAM.opi.build.psram_val=-DBOARD_HAS_PSRAM
wireless_track.menu.PSRAM.opi.build.psram_type=opi

wireless_track.menu.FlashMode.qio=QIO 80MHz
wireless_track.menu.FlashMode.qio.build.flash_mode=dio
wireless_track.menu.FlashMode.qio.build.boot=qio
wireless_track.menu.FlashMode.qio.build.boot_freq=80m
wireless_track.menu.FlashMode.qio.build.flash_freq=80m
wireless_track.menu.FlashMode.qio120=QIO 120MHz
wireless_track.menu.FlashMode.qio120.build.flash_mode=dio
wireless_track.menu.FlashMode.qio120.build.boot=qio
wireless_track.menu.FlashMode.qio120.build.boot_freq=120m
wireless_track.menu.FlashMode.qio120.build.flash_freq=80m
wireless_track.menu.FlashMode.dio=DIO 80MHz
wireless_track.menu.FlashMode.dio.build.flash_mode=dio
wireless_track.menu.FlashMode.dio.build.boot=dio
wireless_track.menu.FlashMode.dio.build.boot_freq=80m
wireless_track.menu.FlashMode.dio.build.flash_freq=80m
wireless_track.menu.FlashMode.opi=OPI 80MHz
wireless_track.menu.FlashMode.opi.build.flash_mode=dout
wireless_track.menu.FlashMode.opi.build.boot=opi
wireless_track.menu.FlashMode.opi.build.boot_freq=80m
wireless_track.menu.FlashMode.opi.build.flash_freq=80m

wireless_track.menu.FlashSize.4M=4MB (32Mb)
wireless_track.menu.FlashSize.4M.build.flash_size=4MB
wireless_track.menu.FlashSize.8M=8MB (64Mb)
wireless_track.menu.FlashSize.8M.build.flash_size=8MB
wireless_track.menu.FlashSize.8M.build.partitions=default_8MB
wireless_track.menu.FlashSize.16M=16MB (128Mb)
wireless_track.menu.FlashSize.16M.build.flash_size=16MB
#wireless_track.menu.FlashSize.32M=32MB (256Mb)
#wireless_track.menu.FlashSize.32M.build.flash_size=32MB

wireless_track.menu.LoopCore.1=Core 1
wireless_track.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
wireless_track.menu.LoopCore.0=Core 0
wireless_track.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

wireless_track.menu.EventsCore.1=Core 1
wireless_track.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
wireless_track.menu.EventsCore.0=Core 0
wireless_track.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

wireless_track.menu.USBMode.hwcdc=Hardware CDC and JTAG
wireless_track.menu.USBMode.hwcdc.build.usb_mode=1
wireless_track.menu.USBMode.default=USB-OTG (TinyUSB)
wireless_track.menu.USBMode.default.build.usb_mode=0

wireless_track.menu.CDCOnBoot.default=Disabled
wireless_track.menu.CDCOnBoot.default.build.cdc_on_boot=0
wireless_track.menu.CDCOnBoot.cdc=Enabled
wireless_track.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

wireless_track.menu.MSCOnBoot.default=Disabled
wireless_track.menu.MSCOnBoot.default.build.msc_on_boot=0
wireless_track.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
wireless_track.menu.MSCOnBoot.msc.build.msc_on_boot=1

wireless_track.menu.DFUOnBoot.default=Disabled
wireless_track.menu.DFUOnBoot.default.build.dfu_on_boot=0
wireless_track.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
wireless_track.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

wireless_track.menu.UploadMode.default=UART0 / Hardware CDC
wireless_track.menu.UploadMode.default.upload.use_1200bps_touch=false
wireless_track.menu.UploadMode.default.upload.wait_for_upload_port=false
wireless_track.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
wireless_track.menu.UploadMode.cdc.upload.use_1200bps_touch=true
wireless_track.menu.UploadMode.cdc.upload.wait_for_upload_port=true

wireless_track.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
wireless_track.menu.PartitionScheme.default.build.partitions=default
wireless_track.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
wireless_track.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
wireless_track.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
wireless_track.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
wireless_track.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
wireless_track.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
wireless_track.menu.PartitionScheme.minimal.build.partitions=minimal
wireless_track.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
wireless_track.menu.PartitionScheme.no_ota.build.partitions=no_ota
wireless_track.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
wireless_track.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
wireless_track.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
wireless_track.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
wireless_track.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
wireless_track.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
wireless_track.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
wireless_track.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
wireless_track.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
wireless_track.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
wireless_track.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
wireless_track.menu.PartitionScheme.huge_app.build.partitions=huge_app
wireless_track.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
wireless_track.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
wireless_track.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
wireless_track.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
wireless_track.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
wireless_track.menu.PartitionScheme.fatflash.build.partitions=ffat
wireless_track.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
wireless_track.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
wireless_track.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
wireless_track.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
wireless_track.menu.PartitionScheme.rainmaker=RainMaker
wireless_track.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
wireless_track.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

wireless_track.menu.CPUFreq.240=240MHz (WiFi)
wireless_track.menu.CPUFreq.240.build.f_cpu=240000000L
wireless_track.menu.CPUFreq.160=160MHz (WiFi)
wireless_track.menu.CPUFreq.160.build.f_cpu=160000000L
wireless_track.menu.CPUFreq.80=80MHz (WiFi)
wireless_track.menu.CPUFreq.80.build.f_cpu=80000000L
wireless_track.menu.CPUFreq.40=40MHz
wireless_track.menu.CPUFreq.40.build.f_cpu=40000000L
wireless_track.menu.CPUFreq.20=20MHz
wireless_track.menu.CPUFreq.20.build.f_cpu=20000000L
wireless_track.menu.CPUFreq.10=10MHz
wireless_track.menu.CPUFreq.10.build.f_cpu=10000000L

wireless_track.menu.UploadSpeed.921600=921600
wireless_track.menu.UploadSpeed.921600.upload.speed=921600
wireless_track.menu.UploadSpeed.115200=115200
wireless_track.menu.UploadSpeed.115200.upload.speed=115200
wireless_track.menu.UploadSpeed.256000.windows=256000
wireless_track.menu.UploadSpeed.256000.upload.speed=256000
wireless_track.menu.UploadSpeed.230400.windows.upload.speed=256000
wireless_track.menu.UploadSpeed.230400=230400
wireless_track.menu.UploadSpeed.230400.upload.speed=230400
wireless_track.menu.UploadSpeed.460800.linux=460800
wireless_track.menu.UploadSpeed.460800.macosx=460800
wireless_track.menu.UploadSpeed.460800.upload.speed=460800
wireless_track.menu.UploadSpeed.512000.windows=512000
wireless_track.menu.UploadSpeed.512000.upload.speed=512000

wireless_track.menu.DebugLevel.none=None
wireless_track.menu.DebugLevel.none.build.code_debug=0
wireless_track.menu.DebugLevel.error=Error
wireless_track.menu.DebugLevel.error.build.code_debug=1
wireless_track.menu.DebugLevel.warn=Warn
wireless_track.menu.DebugLevel.warn.build.code_debug=2
wireless_track.menu.DebugLevel.info=Info
wireless_track.menu.DebugLevel.info.build.code_debug=3
wireless_track.menu.DebugLevel.debug=Debug
wireless_track.menu.DebugLevel.debug.build.code_debug=4
wireless_track.menu.DebugLevel.verbose=Verbose
wireless_track.menu.DebugLevel.verbose.build.code_debug=5

wireless_track.menu.LORAWAN_REGION.0=REGION_EU868
wireless_track.menu.LORAWAN_REGION.0.build.band=REGION_EU868
wireless_track.menu.LORAWAN_REGION.1=REGION_EU433
wireless_track.menu.LORAWAN_REGION.1.build.band=REGION_EU433
wireless_track.menu.LORAWAN_REGION.2=REGION_CN470
wireless_track.menu.LORAWAN_REGION.2.build.band=REGION_CN470
wireless_track.menu.LORAWAN_REGION.3=REGION_US915
wireless_track.menu.LORAWAN_REGION.3.build.band=REGION_US915
wireless_track.menu.LORAWAN_REGION.4=REGION_AU915
wireless_track.menu.LORAWAN_REGION.4.build.band=REGION_AU915
wireless_track.menu.LORAWAN_REGION.5=REGION_CN779
wireless_track.menu.LORAWAN_REGION.5.build.band=REGION_CN779
wireless_track.menu.LORAWAN_REGION.6=REGION_AS923
wireless_track.menu.LORAWAN_REGION.6.build.band=REGION_AS923
wireless_track.menu.LORAWAN_REGION.7=REGION_KR920
wireless_track.menu.LORAWAN_REGION.7.build.band=REGION_KR920
wireless_track.menu.LORAWAN_REGION.8=REGION_IN865
wireless_track.menu.LORAWAN_REGION.8.build.band=REGION_IN865
wireless_track.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
wireless_track.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

wireless_track.menu.LoRaWanDebugLevel.0=None
wireless_track.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
wireless_track.menu.LoRaWanDebugLevel.1=Freq
wireless_track.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
wireless_track.menu.LoRaWanDebugLevel.2=Freq && DIO
wireless_track.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
wireless_track.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
wireless_track.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3

wireless_track.menu.LORAWAN_DEVEUI.0=CUSTOM
wireless_track.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
wireless_track.menu.LORAWAN_DEVEUI.1=Generate By ChipID
wireless_track.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

wireless_track.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
wireless_track.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
wireless_track.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
wireless_track.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

wireless_track.build.defines=-D{build.band} {build.psram_val} -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -D{build.board}
wireless_track.build.extra_libs=-lheltec_{build.cdc_on_boot}
##############################################################
